Repository: darahat-dev-Solutions/Flutter-Starter-Kit
Catalog: lib/l10n/app_*.arb
Languages: km

source: Sign in to continue
km: ចូលដើម្បីបន្ត

source: Welcome
km: សូមស្វាគមន៍

source: Home
km: ទំព័រដើម

source: Cancel
km: បោះបង់

source: Done
km: រួចរាល់

source: Save
km: រក្សាទុក

source: Delete
km: លុប

source: Search
km: ស្វែងរក

source: Settings
km: ការកំណត់

source: Logout
km: ចេញពីប្រព័ន្ធ

source: Flutter Starter Kit
km: ឧបករណ៍ចាប់ផ្ដើម Flutter

source: Email
km: អ៊ីមែល

source: Please enter your email
km: សូមបញ្ចូលអ៊ីមែលរបស់អ្នក

source: Please enter a valid email address
km: សូមបញ្ចូលអាសយដ្ឋានអ៊ីមែលត្រឹមត្រូវ

source: Password
km: ពាក្យសម្ងាត់

source: Please enter your password
km: សូមបញ្ចូលពាក្យសម្ងាត់របស់អ្នក

source: Password must be at least 6 characters
km: ពាក្យសម្ងាត់ត្រូវមានយ៉ាងហោចណាស់ 6 តួអក្សរ

source: Forgot Password?
km: ភ្លេចពាក្យសម្ងាត់?

source: Sign In
km: ចូល

source: OR
km: ឬ

source: Continue with Google
km: បន្តជាមួយ Google

source: Continue with Phone
km: បន្តជាមួយទូរស័ព្ទ

source: Continue with Github
km: បន្តជាមួយ Github

source: Don't have an account?
km: មិនទាន់មានគណនីទេ?

source: Sign Up
km: ចុះឈ្មោះ

source: Create Account
km: បង្កើតគណនី

source: Let's get you started!
km: ចាប់ផ្តើមប្រើប្រាស់

source: Name
km: ឈ្មោះ

source: Please enter your name
km: សូមបញ្ចូលឈ្មោះរបស់អ្នក

source: Please enter a valid email
km: សូមបញ្ចូលអ៊ីមែលត្រឹមត្រូវ

source: Already have an account?
km: មានគណនីរួចហើយ?

# resetEmailSent
source: Reset email sent (if account exists).
km: អ៊ីមែលសម្រាប់កំណត់ពាក្យសម្ងាត់ឡើងវិញត្រូវបានផ្ញើ (ប្រសិនបើមានគណនី)

source: Error:
km: កំហុស៖

# forgotPasswordTitle
source: Forgot Password
km: ភ្លេចពាក្យសម្ងាត់

source: Reset your password
km: កំណត់ពាក្យសម្ងាត់របស់អ្នកឡើងវិញ

# enterTheEmailAssociatedWithYourAccount
source: Enter the email associated with your account and weâ€™ll send you a link to reset your password.
km: សូមបញ្ចូលអ៊ីមែលដែលភ្ជាប់ជាមួយគណនីរបស់អ្នក ហើយយើងនឹងផ្ញើតំណភ្ជាប់សម្រាប់កំណត់ពាក្យសម្ងាត់ឡើងវិញ។

source: Email Address
km: អាសយដ្ឋានអ៊ីមែល

source: Email is required
km: ត្រូវការអ៊ីមែល

source: Enter a valid email
km: សូមបញ្ចូលអ៊ីមែលត្រឹមត្រូវ

source: Send Reset Email
km: ផ្ញើអ៊ីមែលកំណត់ឡើងវិញ

source: Back to Login
km: ត្រឡប់ទៅចូល

source: Enter OTP
km: បញ្ចូល OTP

source: Enter the OTP sent to your phone
km: សូមបញ្ចូល OTP ដែលបានផ្ញើទៅទូរស័ព្ទរបស់អ្នក

source: Verify OTP
km: ផ្ទៀងផ្ទាត់ OTP

source: Resend OTP
km: ផ្ញើ OTP ម្ដងទៀត

source: Resend OTP in
km: ផ្ញើ OTP ម្ដងទៀតក្នុង

source: Enter Phone Number
km: បញ្ចូលលេខទូរស័ព្ទ

source: Enter your phone number
km: សូមបញ្ចូលលេខទូរស័ព្ទរបស់អ្នក

source: We will send you a verification code
km: យើងនឹងផ្ញើកូដផ្ទៀងផ្ទាត់មកអ្នក

source: Phone Number
km: លេខទូរស័ព្ទ

source: Please enter your phone number
km: សូមបញ្ចូលលេខទូរស័ព្ទរបស់អ្នក

source: Send OTP
km: ផ្ញើ OTP

source: Appearance
km: រូបរាង

source: Dark Mode
km: របៀបងងឹត

source: Language
km: ភាសា

source: Add New Task
km: បន្ថែមភារកិច្ចថ្មី

source: Enter task description
km: បញ្ចូលការពិពណ៌នាភារកិច្ច

source: Add Task
km: បន្ថែមភារកិច្ច

source: Take Action
km: ចាត់វិធានការ

source: Task Title
km: ចំណងជើងភារកិច្ច

source: AI-Generated Summary
km: សេចក្ដីសង្ខេបដោយ AI

source: No tasks available to summarize.
km: មិនមានភារកិច្ចសម្រាប់សង្ខេបទេ។

source: See Less
km: មើលតិច

source: See More
km: មើលបន្ថែម

source: Generating summary...
km: កំពុងបង្កើតសេចក្ដីសង្ខេប...

# unableToGenerateSummary
source: Unable to generate summary. Please try again.
km: មិនអាចបង្កើតសេចក្ដីសង្ខេបបានទេ។ សូមសាកល្បងម្តងទៀត។

source: No Tasks yet
km: មិនទាន់មានភារកិច្ចទេ

source: Listening...
km: កំពុងស្តាប់...

# secondPage
source: Messages
km: សារ

source: Chat and Messages
km: ការជជែក និងសារ

# thirdPage
source: AI Chat
km: ការជជែក AI

source: AI Chat Assistant
km: ជំនួយការជជែក AI

source: Help center coming soon!
km: មជ្ឈមណ្ឌលជំនួយនឹងមកដល់ឆាប់ៗនេះ!

source: Dream Flutter Starter Kit
km: ឧបករណ៍ចាប់ផ្ដើម Dream Flutter

# optionSecond
source: Messages
km: សារ

# optionThird
source: AI Chat
km: ការជជែក AI

# readyToExplore
source: Ready to explore? ðŸš€
km: ត្រៀមខ្លួនដើម្បីស្វែងរកទេ? 🚀

source: New Features Coming Soon!
km: មុខងារថ្មីនឹងមកដល់ឆាប់ៗនេះ!

# workingOnExcitingUpdates
source: We're working on exciting updates
km: យើងកំពុងធ្វើការលើការធ្វើបច្ចុប្បន្នភាពដ៏រំភើប

source: AI Chat Features
km: មុខងារជជែក AI

source: Currently under development
km: បច្ចុប្បន្នកំពុងអភិវឌ្ឍ

# aiChatDescription
source: We're building AI Chat option where AI will read your REST API and reply according your provided data
km: យើងកំពុងបង្កើតជម្រើសជជែក AI ដែល AI នឹងអាន REST API របស់អ្នក ហើយឆ្លើយតបតាមទិន្នន័យដែលបានផ្តល់

source: Development Progress
km: ដំណើរការអភិវឌ្ឍន៍

source: Coming Soon Features
km: មុខងារនឹងមកដល់ឆាប់ៗនេះ

source: Give Order
km: ផ្តល់ការបញ្ជាទិញ

source: AI can take order
km: AI អាចទទួលការបញ្ជាទិញ

source: Multi Module
km: ម៉ូឌុលច្រើន

source: Multi Module AI Act
km: AI ម៉ូឌុលច្រើន

source: Voice to Text
km: សំឡេងទៅអត្ថបទ

source: User can Order in voice
km: អ្នកប្រើប្រាស់អាចបញ្ជាទិញដោយសំឡេង

source: Bill Generate
km: បង្កើតវិក្កយបត្រ

source: AI Can Generate Bill
km: AI អាចបង្កើតវិក្កយបត្រ

source: Quick Actions
km: សកម្មភាពរហ័ស

source: Support
km: ជំនួយ

source: Stay Updated
km: ទទួលបានការធ្វើបច្ចុប្បន្នភាព

# notifyWhenReady
source: We'll notify you when new features are ready
km: យើងនឹងជូនដំណឹងដល់អ្នកនៅពេលមុខងារថ្មីរួចរាល់

source: AI Chat Module
km: ម៉ូឌុលជជែក AI

source: Loading settings...
km: កំពុងផ្ទុកការកំណត់...

source: Failed to load settings
km: បរាជ័យក្នុងការផ្ទុកការកំណត់

source: Try Again
km: ព្យាយាមម្តងទៀត

source: Dark theme enabled
km: បើកប្រើរចនាប័ទ្មងងឹត

source: Light theme enabled
km: បើកប្រើរចនាប័ទ្មភ្លឺ

# darkModeDescription
source: Change how the app looks. Dark mode is easier on the eyes in low light.
km: ផ្លាស់ប្តូររូបរាងកម្មវិធី។ របៀបងងឹតងាយស្រួលសម្រាប់ភ្នែកនៅពេលមានពន្លឺតិច។

source: App Language
km: ភាសាកម្មវិធី

# choosePreferredLanguage
source: Choose your preferred language
km: ជ្រើសរើសភាសាដែលអ្នកចូលចិត្ត

source: AI Chat Model
km: ម៉ូដែលជជែក AI

# choosePreferredAiModel
source: Choose your preferred AI model
km: ជ្រើសរើសម៉ូដែល AI ដែលអ្នកចូលចិត្ត

# aiModelCapabilities
source: Different AI models may have varying capabilities and response styles.
km: ម៉ូដែល AI ផ្សេងៗគ្នាអាចមានសមត្ថភាពនិងរចនាប័ទ្មឆ្លើយតបខុសៗគ្នា។

source: Welcome User
km: សូមស្វាគមន៍អ្នកប្រើប្រាស់

source: AI Assistant
km: ជំនួយការ AI

source: Messages
km: សារ

source: No Name
km: គ្មានឈ្មោះ
